{"singlePage": [], "startSite": "", "filingNum": "", "onePageListNum": 15, "commentLabelColor": "#006b75", "yearColorList": ["#bc4c00", "#0969da", "#1f883d", "#A333D0"], "i18n": "CN", "themeMode": "manual", "dayTheme": "light", "nightTheme": "dark", "urlMode": "pinyin", "script": "", "style": "", "bottomText": "", "showPostSource": 1, "iconList": {}, "UTC": 8, "rssSplit": "sentence", "exlink": {}, "title": "NGANUN", "displayTitle": "Just do it", "subTitle": "Less is More", "homeUrl": "https://nganun.github.io", "avatarUrl": "https://avatars.githubusercontent.com/u/92292545?v=4", "faviconUrl": "https://avatars.githubusercontent.com/u/92292545?v=4", "GMEEK_VERSION": "last", "postListJson": {"P3": {"htmlDir": "docs/post/Reading - The Modern JavaScript.html", "labels": ["cheat-sheet"], "postTitle": "Reading - The Modern JavaScript", "postUrl": "post/Reading%20-%20The%20Modern%20JavaScript.html", "postSourceUrl": "https://github.com/nganun/nganun.github.io/issues/3", "commentNum": 0, "wordCount": 5305, "description": "## 第一部分 JavaScript 编程语言\r\n\r\n## 02 JavaScript 基础知识\r\n\r\n### `<script>` 标签\r\n\r\n- 使用独立文件的好处是浏览器会下载它，然后将它保存到浏览器的缓存中\r\n- 如果设置了 src 属性，script 标签内的内容将被忽略\r\n\r\n### 代码结构\r\n\r\n- 语句\r\n- 分号\r\n  - 错误例子\r\n  ```js\r\n  alert(\"hello\")\r\n  [1,2].forEach(alert);\r\n  ```\r\n- 注释\r\n\r\n### `\"use strict\"` 模式\r\n\r\n- 请确保`\"use strict\"` 出现在脚本的最顶部，否则严格模式可能均未启用。", "top": 0, "createdAt": 1709870608, "style": "", "script": "", "createdDate": "2024-03-08", "dateLabelColor": "#bc4c00"}, "P6": {"htmlDir": "docs/post/Blogging with github action and gh.html", "labels": ["tools"], "postTitle": "Blogging with github action and gh", "postUrl": "post/Blogging%20with%20github%20action%20and%20gh.html", "postSourceUrl": "https://github.com/nganun/nganun.github.io/issues/6", "commentNum": 0, "wordCount": 836, "description": "# How to post with gh\r\n\r\n> Purpose\r\n> Record the post method\r\n\r\n## List post\r\n\r\n```sh\r\ngh issue list\r\n```\r\n\r\n## New post\r\n\r\n```sh\r\n# This backup file is created by github actions, there I just use the file for edit.\r\n# -t title, -l label, -F File\r\ngh issue create -t test -l autoscript -F .\\backup\\draft.md\r\n# -b body\r\ngh issue create -t test -l autoscript -b 'This is the body'\r\n```\r\n\r\n## View post\r\n\r\n```sh\r\ngh issue view 3\r\ngh issue view 3 --web\r\n```\r\n\r\n## Edit post\r\n\r\n```sh\r\n# modify the title and body of the number 5 issue.\r\ngh issue edit 5 -t autoscript -b 'short body'\r\n```\r\n\r\n## Delete post\r\n\r\n```sh\r\ngh issue delete 5\r\n```\r\n\r\n## New label\r\n\r\n```sh\r\ngh label create name\r\n```\r\n\r\n## Invoke Actions\r\n\r\n```gh\r\n# Invoke actions with interactive\r\ngh workflow run\r\n# Show the action status\r\ngh run list --workflow=Gmeek.yml\r\n```\r\n\r\n。", "top": 0, "createdAt": 1710207835, "style": "", "script": "", "createdDate": "2024-03-12", "dateLabelColor": "#bc4c00"}, "P7": {"htmlDir": "docs/post/Tools - Less is MOre.html", "labels": ["tools"], "postTitle": "Tools - Less is MOre", "postUrl": "post/Tools%20-%20Less%20is%20MOre.html", "postSourceUrl": "https://github.com/nganun/nganun.github.io/issues/7", "commentNum": 0, "wordCount": 217, "description": "## Concept\r\n\r\n1. Less is More\r\n2. Start with less, give it time, have fun\r\n\r\n## Tool List\r\n\r\n**File Manager**\r\n\r\n- yazi\r\n\r\n**Editor**\r\n\r\n- lazyvim\r\n- vscode\r\n\r\n**Terminal**\r\n\r\n- zsh (linux)\r\n- powershell (windows)\r\n\r\n。", "top": 0, "createdAt": 1711948315, "style": "", "script": "", "createdDate": "2024-04-01", "dateLabelColor": "#bc4c00"}, "P8": {"htmlDir": "docs/post/Cheatsheet - Maximo Map.html", "labels": ["cheat-sheet"], "postTitle": "Cheatsheet - Maximo Map", "postUrl": "post/Cheatsheet%20-%20Maximo%20Map.html", "postSourceUrl": "https://github.com/nganun/nganun.github.io/issues/8", "commentNum": 0, "wordCount": 12455, "description": "# Cheatsheet - Maximo Map\r\n\r\nReferences: [Maximo Mange Modules](https://maximosecrets.com/2024/04/16/maximo-manage-modules/)\r\n\r\n\r\n## Administrations\r\n\r\n## Analytics\r\n\r\n## Assets\r\n\r\n### Assets\r\n\r\n### Asset Templates\r\n\r\n### Locations\r\n\r\n### Meters\r\n\r\nUsed to define a type of meter before it is associated with other application records, assets, locations, PMs, items, and condition monitoring. There are three types of meters, continuous, gauge and characteristic.\r\n\r\n**References**\r\n- [Meters, Meter Groups and Conditions Monitoring](https://maximosecrets.com/2022/07/15/meters-meter-groups-and-condition-monitoring-2/)\r\n\r\n**Conceptions**\r\n1. The three types of meters\r\n   - Continuous\r\n     - A CONTINUOUS meter is one where the meter reading increments over time unless it is reset, or it rolls over.\r\n     - This is the most common meter type as it is the type used with meter-based Preventive Maintenance.\r\n     - With a CONTINUOUS meter you need to decide whether the meter reading type is an ACTUAL or a DELTA reading when compared to the previous reading. \r\n   - Characteristic\r\n     - A CHARACTERISTIC meter is used for an observation, the values of which can be selected from a domain set of values. \r\n     - This might be how filthy your car is from Clean, Minor Dirt, Dirty, to Very Dirty, and you would take action when the observation value you make at the beginning of the week assesses your car as Dirty or Very Dirty. \r\n     - With a CHARACTERISTIC meter you will need to specify the ALN Domain to be used for the observations, other types of domain can’t be used. \r\n   - Gauge\r\n     - The third type is a GAUGE meter that records a numeric measurement the readings of which can fluctuate over time.\r\n     - Think of the pressure gauge on a car tyre, you could record the measurement at the start of each week and when it drops below a certain level you need to take action. \r\n- For a CONTINUOUS or GAUGE meter it is a good idea to indicate the unit of measure, this is not needed for a CHARACTERISTIC meter.\r\n- The Where Used tab indicates where the meter has been referenced, and there are five tabs to show the Assets, Locations, PMs, Items, or Condition Monitoring records where the meter is used. A meter on an Item or Tool is most often used for measuring fluid consumption, for example the diesel or petrol you put in your car.\r\n\r\n\r\n**Pages**\r\n1. Meter\r\n- Meter: METER.METERNAME\r\n- Domain: DOMAINID\r\n- Meter Type: METERTYPE\r\n- Unit of Measure: MEASUREUNITID\r\n- Reading Type: READINGTYPE\r\n\r\n**Object and Relationships**\r\n- Table - Assets: ASSETMETER\r\n- Table - Locations: LOCATIONMETER\r\n- Table - PMs: PMMETER\r\n- Table - Items: ITEM\r\n- Table - Condition Monitoring: MEASUREPOINT\r\n\r\n\r\n### Meter Groups\r\n\r\nMeters can be grouped together. When a meter group is applied to an asset or location all the meters of the group will be created for it. \r\n\r\n**References**\r\n- [Meters, Meter Groups and Conditions Monitoring](https://maximosecrets.com/2022/07/15/meters-meter-groups-and-condition-monitoring-2/)\r\n\r\n**Conceptions**\r\n- A Meter Group as the name implies is a set of meters that are used together. \r\n- When a meter group is applied to an asset or location, the meters in the meter group are copied over to become asset meters or location meters. All three meter types can exist in a meter group. \r\n- One advantage of using a meter group is that a new meter can be added to the meter group, and you can choose whether it should also be added to all assets and locations that reference this meter group. The table field ‘Apply This Meter Where Group Is Used?’  is defaulted from the header field ‘Apply New Meters Where Group Is Used?’ . When adding a new meter the table field can be modified until you save the meter to the meter group, when it then becomes read-only.\r\n- There is no status field for a Meter Group and Meters Groups are added at the System level in Maximo, the same as for Meters.\r\n- Meter Groups can be referenced on an Asset Template, and this adds the associated meters to the asset template. \r\n- A Meter Group can also be referenced on an Item or Tool of type Rotating. When an asset is created and references the item or tool, then the meter group is copied, and the asset meters created for the set of meters in the meter group. The same process also applies to a location that references a Rotating Item.\r\n- For CONTINUOUS meters only, additional setup is required in the details area of the meter in the meter group\r\n  - For continuous meters you should add the point at which the meter will rollover , and I would use the decimal places.\r\n  - The field Average Calculation Method  determines how the average units per day field is calculated for the asset or location meter. This is used by meter-based Preventive Maintenance to determine when the PM will fall due. The Select Value shows four options:\r\n    - LL is the default and takes into account all previous meter readings. This is fine to use where an asset is in constant operation and does not stand idle for long periods of time.\r\n    - STATIC is where there is no recalculation and you enter an average value in the Static Average field  at the bottom right corner of the details area. This might be used when you don’t have a history of meter readings in Maximo but you can work out a historical average, or you have an average that you wish to apply for meter based PMs.\r\n    - STATIC is where there is no recalculation and you enter an average value in the Static Average field  at the bottom right corner of the details area. This might be used when you don’t have a history of meter readings in Maximo but you can work out a historical average, or you have an average that you wish to apply for meter based PMs.\r\n    - STATIC is where there is no recalculation and you enter an average value in the Static Average field  at the bottom right corner of the details area. This might be used when you don’t have a history of meter readings in Maximo but you can work out a historical average, or you have an average that you wish to apply for meter based PMs.\r\n  - If a meter reading is performed each day of the week, the SLIDING-READINGS will give the same result as SLIDING-DAYS. However, if no meter readings are taken on a Saturday or Sunday, then there will be a difference in the average between the two calculation methods.\r\n  - To determine whether to use SLIDING-READINGS or SLIDING-DAYS you need to ascertain how often you take a meter reading and whether the pattern is regular or irregular. With either of these two settings you need to bear in mind that an average over two readings is not a good average, you do need a larger number of readings. You also need to consider the pattern of use of the asset and you may need to take meter readings more frequently to use these settings.\r\n\r\n\r\n**Pages**\r\n1. Meter Group\r\n- Meter Group: METERGROUP.GROUPNAME\r\n- Apply New Meters Where Group Is Used?: PROPAGATEMOD\r\n- Table - Meters in Group: METERINGROUP\r\n  - Meter Rollover: ROLLOVER\r\n  - Apply This Meter Where Group Is Used: PROPAGATEMETERGROUPMOD\r\n  - Average Calculation Method: AVGCALCMETHOD\r\n  - Sliding Window Size: SLIDINGWINDOWSIZE\r\n  - Static Average: STATICAVERAGE\r\n\r\n### Condition Monitoring\r\n\r\nUsed to create a measurement point for an asset or location. A measurement point is defined for a type of gauge or characteristic meter. When a measurement is received, and it is outside the action limits or is of a specific characteristic then a work order can be generated for it.\r\n\r\n**References**\r\n- [Meters, Meter Groups and Conditions Monitoring](https://maximosecrets.com/2022/07/15/meters-meter-groups-and-condition-monitoring-2/)\r\n\r\n**Conceptions**\r\n- The Condition Monitoring application is used to create measurement points for GAUGE meters or observation points for CHARACTERISTIC meters. The application is not used with CONTINUOUS meters. As these records will always reference either a location or asset (and not both), then this is a Site level object  in Maximo. There is no status field for a Condition Monitoring Point.\r\n- To create a Condition Monitoring Point you need to reference a location or asset , and a meter. The Point field , called POINTNUM in the table, is often a field which has been generated by the autokey, it is the unique identifier for the record. Some clients use a prefix aligned with the asset class. However, I would leave this as an autokey with no prefix for the reason that the proliferation of sensors and alarm conditions would slow down the process of creating MEASUREPOINT records if you gave meaning to the structure of the identifier. You can always configure the asset class onto the application using a relationship back to the ASSETS object and add it to the Advanced Search or List tab to make it easier to query.\r\n- The measurement or observation is recorded as part of a meter reading. You create a Condition Monitoring point if you wish to take action when a measurement exceeds upper or lower action limits, or an observation reaches a certain value. If you are not going to generate work orders when this occurs then there is little point in creating a Condition Monitoring record. You can record the measurement or observation direct in the Condition Monitoring application or through an integration point from an external source, but it is now normal to record these values through meter readings because meter readings are also used for CONTINUOUS meters.\r\n- Meters of type GAUGE or CHARACTERISTIC can be referenced with their asset or location to create a condition monitoring point. When a record is created in the Condition Monitoring application the key field, POINTNUM, is copied to the asset meter or location meter record, which must, obviously, exist first. For GAUGE or CHARACTERISTIC meters the meter reading is copied through to the MEASUREMENTS table and the Measurement or Observation fields using the POINTNUM field as the key.\r\n- When setting up a Condition Monitoring point you need to specify the upper/lower action limits  and the Job Plan or PM that will be used to generate a work order if the action limits are exceeded. The work order’s priority is also normally set. It is slightly different for CHARACTERISTIC meters in that you enter the values from the meter’s ALN domain that require an action, which does mean that you could use different job plans, PMs or priorities for each value.\r\n- Work orders are generated either manually or through a background Cron Task and the work orders generated are visible in the Condition Monitoring record. The work order status will be Waiting to be Approved (WAPPR) and there will be a blank work type.\r\n- For GAUGE meters you can also enter the upper/lower warning limits but there is no Maximo functionality that uses this. There is also no Maximo functionality that allows Condition Monitoring records to be created from a template and unusually for a Maximo application there is no Duplicate action. An Application Import could be configured to allow condition monitoring points to be created from a spreadsheet.\r\n\r\n**Pages**\r\n1. condition Monitoring\r\n- Point: MEASUREPOINT.POINTNUM\r\n- Site:\r\n- Location:\r\n- Asset:\r\n- Meter: METERNAME\r\n- Unit of Measure: MEASUREUNITID\r\n- Section - Upper Limits\r\n  - Upper Warning Limit: UPPERWARNING\r\n  - Upper Action Limit: UPPERACTION\r\n  - Upper Limit PM: ULPMNUM\r\n  - Upper Limit Job Plan: ULJPNUM\r\n  - Upper Limit Priority: ULPRIORITY\r\n- Section - Lower Limits\r\n  - LL...\r\n- Table - Characteristic Action Values: CHARPOINTACTION\r\n  - Value: VALUE\r\n  - PM: PMNUM\r\n  - Job Plan: JPNUM\r\n  - Priority: PRIORITY\r\n- Table - Measurements: MEASUREMENT\r\n  - Measurement Date: MEASUREDATE\r\n  - Measurement: MEASUREMENTVALUE\r\n  - Observation: OBSERVATION\r\n  - Start Measure: STARTMEASURE\r\n    - just Characteristic\r\n  - End Measure: ENDMEASURE\r\n    - Characteristic\r\n- Table - History: POINTWO\r\n  - Work Order: WONUM\r\n  - Effective Date: EFFECTIVEDATE\r\n\r\n### Failure Codes\r\n\r\n### Asset Management\r\n\r\n### Reliability Strategies\r\n\r\n## Building Information Models\r\n\r\n## Contracts\r\n\r\n## Financial\r\n\r\n## IT Infrastructure\r\n\r\n## Integration\r\n\r\n## Inventory\r\n\r\n## Planning\r\n\r\n## Planning and Scheduling\r\n\r\n## Preventive Maintenance\r\n\r\n## Purchasing\r\n\r\n## Security\r\n\r\n## Self Service\r\n\r\n## Service Desk\r\n\r\n## Service Level\r\n\r\n## System Configuration\r\n\r\n## Task Management\r\n\r\n## Work Orders\r\n\r\n## Non Module Applications\r\n\r\n### Start Center Applications\r\n\r\n### Other Applications。", "top": 0, "createdAt": 1713763634, "style": "", "script": "", "createdDate": "2024-04-22", "dateLabelColor": "#bc4c00"}}, "singeListJson": {}, "labelColorDict": {"autoscript": "#13CE89", "bug": "#d73a4a", "cheat-sheet": "#F6DF2C", "mas": "#0A46DE", "tools": "#006B75"}, "prevUrl": "disabled", "nextUrl": "disabled"}